{
    "inizio": {
        "introduzione_capitolo": "Due bambini si avventurano in un bosco incantato, seguendo una luce misteriosa che si intravede tra gli alberi.",
        "descrizione_scena": "Un bosco pieno di alberi maestosi, con un tappeto di muschio soffice e lucciole che illuminano il sentiero.",
        "personaggio_unico": {
            "nome": "Lumi",
            "descrizione": "Un gufo parlante con piume argentate e occhi luminosi, che conosce i segreti del bosco."
        },
        "collegamento_scena_successiva": {
            "fine_capitolo": "Lumi indica ai bambini due sentieri, uno conduce alla Quercia Dorata e l'altro alla Radura Magica. Devono scegliere quale seguire.",
            "percorso_1": "Sentiero della Quercia Dorata",
            "percorso_2": "Sentiero della Radura Magica"
        }
    },
    "fase_intermedia": {
        "percorso_1": {
            "introduzione_capitolo": "I bambini imboccano il sentiero che conduce alla Quercia Dorata, incuriositi dalla luce dorata che si intravede tra le foglie.",
            "descrizione_scena": "Un albero gigantesco con foglie d'oro che brillano al sole. Intorno si trovano piccole creature che giocano e cantano.",
            "personaggio_unico": {
                "nome": "Arlo",
                "descrizione": "Un simpatico scoiattolo parlante che vive nella Quercia Dorata. Ama raccontare storie e aiutare i visitatori del bosco."
            }
        },
        "percorso_2": {
            "introduzione_capitolo": "I bambini scelgono il sentiero verso la Radura Magica, attratti da una luce soffusa che illumina il cammino.",
            "descrizione_scena": "Una radura circondata da fiori che emettono una luce delicata. Al centro si trova una pietra che pulsa di energia magica.",
            "personaggio_unico": {
                "nome": "Nia",
                "descrizione": "Una fata dai capelli scintillanti e ali luminose. Custodisce la magia della radura e accoglie i viaggiatori."
            }
        },
        "collegamento_scena_successiva": {
            "fine_capitolo": "Dopo aver incontrato Arlo o Nia, i bambini vengono accompagnati verso una radura centrale, dove il bosco nasconde un grande segreto."
        }
    },
    "conclusione": {
        "introduzione_capitolo": "I bambini raggiungono una radura speciale, dove il bosco sembra prendere vita e i suoi segreti vengono svelati.",
        "descrizione_scena": "Una grande radura illuminata da un maestoso albero al centro, con rami che sembrano toccare il cielo. Il luogo è pervaso da un'atmosfera magica e serena.",
        "personaggio_unico": {
            "nome": "Lumi",
            "descrizione": "Il gufo che li ha guidati fin dall'inizio. Ora si mostra orgoglioso del viaggio compiuto dai bambini."
        },
        "conclusione": "Lumi spiega che il bosco premia sempre chi lo esplora con curiosità e rispetto. I bambini, pieni di meraviglia, promettono di tornare presto per nuove avventure."
    }
}
